swagger/src/Catalogs/Компоненты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Компоненты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>schemas</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>name</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>schema</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Схемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>responses</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>name</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>response</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СправочныеОбъекты</v8:Type>
								<v8:Type>cfg:CatalogRef.Ответы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>parameters</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>name</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>parameter</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Параметры</v8:Type>
								<v8:Type>cfg:CatalogRef.СправочныеОбъекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>examples</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>name</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>example</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СправочныеОбъекты</v8:Type>
								<v8:Type>cfg:CatalogRef.Примеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>requestBodies</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>name</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>requestBody</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СправочныеОбъекты</v8:Type>
								<v8:Type>cfg:CatalogRef.ТелоЗапросов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>headers</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>name</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>header</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Заголовки</v8:Type>
								<v8:Type>cfg:CatalogRef.СправочныеОбъекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>securitySchemes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>name</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>securityScheme</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СправочныеОбъекты</v8:Type>
								<v8:Type>cfg:CatalogRef.СхемыБезопасности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>links</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>name</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>link</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СправочныеОбъекты</v8:Type>
								<v8:Type>cfg:CatalogRef.Линки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>callbacks</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>name</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>callback</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбратныеВызовы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>pathItems</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>name</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>pathItem</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СправочныеОбъекты</v8:Type>
								<v8:Type>cfg:CatalogRef.Пути</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

swagger/src/Catalogs/Компоненты/Ext/ObjectModule.bsl
Функция СформироватьJsonSwagger() Экспорт 
	Описание = Новый Соответствие;
	
	Если ЭтотОбъект.schemas.Количество() > 0 Тогда
		Описание.Вставить("schemas", ОбщегоНазначенияSwagger.СформироватьСоответствиеИзТЧ(ЭтотОбъект, "schemas", "name", "schema"));
	КонецЕсли;
	
	Если ЭтотОбъект.responses.Количество() > 0 Тогда
		Описание.Вставить("responses", ОбщегоНазначенияSwagger.СформироватьСоответствиеИзТЧ(ЭтотОбъект, "responses", "name", "response"));
	КонецЕсли;
	
	Если ЭтотОбъект.parameters.Количество() > 0 Тогда
		Описание.Вставить("parameters", ОбщегоНазначенияSwagger.СформироватьСоответствиеИзТЧ(ЭтотОбъект, "parameters", "name", "parameter"));
	КонецЕсли;
	
	Если ЭтотОбъект.examples.Количество() > 0 Тогда
		Описание.Вставить("examples", ОбщегоНазначенияSwagger.СформироватьСоответствиеИзТЧ(ЭтотОбъект, "examples", "name", "example"));
	КонецЕсли;
	
	Если ЭтотОбъект.requestBodies.Количество() > 0 Тогда
		Описание.Вставить("requestBodies", ОбщегоНазначенияSwagger.СформироватьСоответствиеИзТЧ(ЭтотОбъект, "requestBodies", "name", "requestBody"));
	КонецЕсли;
	
	Если ЭтотОбъект.headers.Количество() > 0 Тогда
		Описание.Вставить("headers", ОбщегоНазначенияSwagger.СформироватьСоответствиеИзТЧ(ЭтотОбъект, "headers", "name", "header"));
	КонецЕсли;
	
	Если ЭтотОбъект.securitySchemes.Количество() > 0 Тогда
		Описание.Вставить("securitySchemes", ОбщегоНазначенияSwagger.СформироватьСоответствиеИзТЧ(ЭтотОбъект, "securitySchemes", "name", "securityScheme"));
	КонецЕсли;
	
	Если ЭтотОбъект.links.Количество() > 0 Тогда
		Описание.Вставить("links", ОбщегоНазначенияSwagger.СформироватьСоответствиеИзТЧ(ЭтотОбъект, "links", "name", "link"));
	КонецЕсли;
	
	Если ЭтотОбъект.callbacks.Количество() > 0 Тогда
		Описание.Вставить("callbacks", ОбщегоНазначенияSwagger.СформироватьСоответствиеИзТЧ(ЭтотОбъект, "callbacks", "name", "callback"));
	КонецЕсли;
	
	Если ЭтотОбъект.pathItems.Количество() > 0 Тогда
		Описание.Вставить("pathItems", ОбщегоНазначенияSwagger.СформироватьСоответствиеИзТЧ(ЭтотОбъект, "pathItems", "name", "pathItem"));
	КонецЕсли;
	
	
	Возврат КоннекторHTTP.ОбъектВJson(Описание);
КонецФункции
